Autodesk.Revit.DB.NumberedReferenceInfo.GetReference
The target reference for this object.
Since:
2027

Autodesk.Revit.DB.NumberedReferenceInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.NumberedReferenceInfo.Value
The integer representation of number associated with this reference.
Since:
2027

Autodesk.Revit.DB.NumberedReferenceInfo.FormattedNumber
The formated number associated with this reference.
Since:
2027

Autodesk.Revit.DB.NumberedReferenceInfo.NumberingParameterId
The parameter id associated with this reference that is used for numbering.
Since:
2027

Autodesk.Revit.DB.NumberedReferenceInfo.PartitionName
The partition associated with this reference.
Since:
2027

Autodesk.Revit.DB.NumberedReferenceInfo.NumberingSchemaId
The numbering schema associated with this reference.
Since:
2027

Autodesk.Revit.DB.NumberedReferenceInfo.NumberingSchemaName
The name of the numbering schema associated with this reference.
Since:
2027

Autodesk.Revit.DB.NumberedReferenceInfo.#ctor(Autodesk.Revit.DB.NumberedReferenceInfo)
Creates a copy of the NumberedReferenceInfo.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberedReferenceInfo
Numbering info for a reference.
Since:
2027